name: "single_input"
backend: "rknn"
max_batch_size : 1
input [
  {
    name: "input"
    data_type: TYPE_UINT8
    dims: [ 224, 224, 3 ]
  }
]
output [
  {
    name: "MobilenetV1/Predictions/Reshape_1"
    data_type: TYPE_FP32
    dims: [ 1001 ]
  }
]
instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [ 0 ]
  }
]
