name: "multi_input"
backend: "rknn"
max_batch_size : 1
input [
  {
    name: "input.1"
    data_type: TYPE_UINT8
    dims: [ 128, 128, 1 ]
  },
  {
    name: "input"
    data_type: TYPE_UINT8
    dims: [ 128, 128, 3 ]
  }

]
output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 8, 128, 128 ]
  }
]
